In [63]:
import pandas as pd
import numpy as np
import seaborn as sns

### 누락 데이터 처리

In [22]:
#누락 데이터 확인

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
#결측치 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [24]:
#deck 열의 누락 데이터 개수 구하기,dropna=False
nan_deck = df['deck'].value_counts(dropna=False)
print(nan_deck)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [25]:
#isnull() 메소드로 누락데이터 찾기
print(df.head().isnull())

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False

In [26]:
#notnull() 메소드로 누락 데이터 찾기
print(df.head().notnull())
#False -> 결측치

   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True

In [27]:
#isnull() 메소드로 누락 데이터 개수 구하기
print(df.head().isnull().sum(axis=0))

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

In [31]:
#누락 데이터 제거
df = sns.load_dataset('titanic')
#for 반복문으로 각 열의 NaN 개수 계산하기
missing_df = df.isnull()
for col in missing_df.columns:
    missing_count = missing_df[col].value_counts()       #각 열의 NaN 개수 파악
    try:
        print(col, ': ', missing_count[True])            #NaN 값이 있으면 개수 출력
    except:
        print(col, ': ', 0)                               #NaN 값이 없으면 0개 출력

survived :  0
pclass :  0
sex :  0
age :  177
sibsp :  0
parch :  0
fare :  0
embarked :  2
class :  0
who :  0
adult_male :  0
deck :  688
embark_town :  2
alive :  0
alone :  0

In [32]:
#NaN 값이 500개 이상인 열을 모두 삭제 - deck 열(891개 중 688개의 NaN 값)
df_thresh = df.dropna(axis=1, thresh=500)
print(df_thresh.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [33]:
#age 열에 나이 데이터가 없는 모든 행 삭제 - age 열(891개 중 177개의 NaN 값)
df_age = df.dropna(subset=['age'], how='any',axis=0)
print(len(df_age))

714

In [35]:
#누락 데이터 치환
print(df['age'].head(10))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [37]:
#age 열의 결측치를 다른 나이 데이터의 평균으로 변경
mean_age = df['age'].mean(axis=0) #age 열의 평균 계산(NaN 값 제외)
df['age'].fillna(mean_age, inplace=True)

#age 열의 첫 10개 데이터 출력(5행에 NaN 값이 평균으로 대체됨
print(df['age'].head(10))

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [38]:
#승선도시를 나타냄, 결측치 NaN을 찾아서 바꿔준다.
print(df['embark_town'][825:830])
print('\n')

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [43]:
#embark_town 열의 NaN 값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기
most_freq = df['embark_town'].value_counts(dropna=True).idxmax()
print(most_freq)
print('\n')

df['embark_town'].fillna(most_freq, inplace=True)

#embark_town 열 829행의 NaN 데이터출력(NaN 값이 most_freq 값으로 대체됨)
print(df['embark_town'][825:830])

Southampton


825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [45]:
#embark_town 열 829행의 NaN 데이터 출력
df = sns.load_dataset('titanic')

print(df['embark_town'][825:830])
print('\n')

#embark_town 열의 NaN 값을 바로 앞에 있는 828행의 값으로 변경하기
df['embark_town'].fillna(method='ffill', inplace=True)
print(df['embark_town'][825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object


825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

### 중복 데이터 처리

In [46]:
#중복 데이터 확인, duplicated() 메소드를 이용

df = pd.DataFrame({'c1' : ['a','a','b','a','b'],
                  'c2' : [1,1,1,2,2],
                  'c3':[1,1,2,2,2]})
print(df)
print('\n')

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [50]:
#중복행 True, 비중복 False
#데이터프레임 전체 행 데이터 중에서 중복값 찾기
df_dup = df.duplicated()
print(df_dup)
print('\n')

#데이터프레임에서 중복 행 제거
df2 = df.drop_duplicates()
print(df2)
print('\n')

#c2,c3열을 기준으로 중복 행 제거
df3 = df.drop_duplicates(subset=['c2','c3'])
print(df3)

0    False
1     True
2    False
3    False
4    False
dtype: bool


  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2


  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

## 데이터 표준화

In [60]:
#단위 환산
df = pd.read_csv('데이터분석책/part3/auto-mpg.csv',header=None, encoding='utf-8')
df.columns = ['mpg','cylineders','displacement','horsepower','weight',
              'acceleration','model year','origin','name']
print(df.head(3))
print('\n')


#mpg를 kpl로 변환(mpg_to_kpl = 0.425)
mpg_to_kpl = 1.60934/3.78541

#mpg열에 0.425를 곱한 결과를 새로운 열(kpl)에 추가
df['kpl'] = df['mpg'] * mpg_to_kpl
print(df.head(3))
print('\n')

#kpl 열을 소수점 아래 둘째자리에서 반올림
df['kpl'] = df['kpl'].round(2)

    mpg  cylineders  displacement horsepower  weight  acceleration  \
0  18.0           8         307.0      130.0  3504.0          12.0
1  15.0           8         350.0      165.0  3693.0          11.5
2  18.0           8         318.0      150.0  3436.0          11.0

   model year  origin                       name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite


    mpg  cylineders  displacement horsepower  weight  acceleration  \
0  18.0           8         307.0      130.0  3504.0          12.0
1  15.0           8         350.0      165.0  3693.0          11.5
2  18.0           8         318.0      150.0  3436.0          11.0

   model year  origin                       name       kpl
0          70       1  chevrolet chevelle malibu  7.652571
1          70       1          buick skylark 320  6.377143
2          70       1         plymouth satellite  7.652571

In [62]:
#단위 환산
df = pd.read_csv('데이터분석책/part3/auto-mpg.csv',header=None)
df.columns = ['mpg','cylineders','displacement','horsepower','weight',
              'acceleration','model year','origin','name']
#각 열의 자료형 확인
print(df.dtypes)
print('\n')

#object -> 숫자형으로 변환해주는 것이 적절함
#horsepower 열의 고유값 확인
print(df['horsepower'].unique())

mpg             float64
cylineders        int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model year        int64
origin            int64
name             object
dtype: object


['130.0' '165.0' '150.0' '140.0' '198.0' '220.0' '215.0' '225.0' '190.0'
 '170.0' '160.0' '95.00' '97.00' '85.00' '88.00' '46.00' '87.00' '90.00'
 '113.0' '200.0' '210.0' '193.0' '?' '100.0' '105.0' '175.0' '153.0'
 '180.0' '110.0' '72.00' '86.00' '70.00' '76.00' '65.00' '69.00' '60.00'
 '80.00' '54.00' '208.0' '155.0' '112.0' '92.00' '145.0' '137.0' '158.0'
 '167.0' '94.00' '107.0' '230.0' '49.00' '75.00' '91.00' '122.0' '67.00'
 '83.00' '78.00' '52.00' '61.00' '93.00' '148.0' '129.0' '96.00' '71.00'
 '98.00' '115.0' '53.00' '81.00' '79.00' '120.0' '152.0' '102.0' '108.0'
 '68.00' '58.00' '149.0' '89.00' '63.00' '48.00' '66.00' '139.0' '103.0'
 '125.0' '133.0' '138.0' '135.0' '142.0' '77.00' '62.00' '132.0' '84.00'
 '64.00' '74.00' '116.0' '82.00']

In [66]:
# 결측치 '?' -> np.nan으로 변경
df['horsepower'].replace('?', np.nan, inplace=True)
#누락 데이터 행 삭제
df.dropna(subset=['horsepower'], axis=0, inplace=True)
#문자열을 실수형으로 변환
df['horsepower'] = df['horsepower'].astype('float')

#horsepower 열의 자료형 확인
print(df['horsepower'].dtypes)

float64

In [69]:
#origin 열의 고유값 확인
print(df['origin'].unique())

#정수형 데이터를 문자열 데이터로 변환
df['origin'].replace({1:'USA',2:'EU',3:'JPN'}, inplace=True)

#origin 열의 고유값과 자료형 확인
print(df['origin'].unique())
print(df['origin'].dtypes)

#문자열을 범주형으로 변환
df['origin'] = df['origin'].astype('category')  
print(df['origin'].dtypes)

#범주형을 문자열로 다시 변환
df['origin'] = df['origin'].astype('str')  
print(df['origin'].dtypes)

['USA', 'JPN', 'EU']
Categories (3, object): ['EU', 'JPN', 'USA']
['USA', 'JPN', 'EU']
Categories (3, object): ['EU', 'JPN', 'USA']
category
category
object

In [70]:
#model year 열의 정수형을 범주형으로 변환
#자료형은 숫자형태를 갖더라도 범주형으로 표현하는 것을 권장함
print(df['model year'].sample(3))
df['model year'] = df['model year'].astype('category')
print(df['model year'].sample(3))

44     71
128    74
204    76
Name: model year, dtype: int64
287    79
25     70
118    73
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]